var glossary = [
    {word:"",
     def:"<h2><i>ПОЖАЛУЙСТА, УКАЗЫВАЙТЕ ТИП САЙТА!</i></h2>"},
    {
        word:"Сайт-визитка",
        def:"Сайт-визитка обычно состоит из нескольких страниц, на которых дается краткая информация о компании, предоставляемых ей услугах и контактах. Основными преимуществами сайта-визитки являются низкая стоимость создания и быстрый запуск, а недостатками –низкий функционал и бедный дизайн. Веб-сайт магазина «Антиквариат» имеет небольшой объем информации по спецификации и деятельности магазина и простой, но достаточно приятный дизайн. Интернет-ресурс компании ООО «Три-Р» также является сайтом визиткой, при чем довольно высокого уровня. Удобный и приятный дизайн, наличие галереи товаров,а также возможность оформления заказа через сайт – те достоинства, которые могут привлечь клиента. Если нужно проинформировать людей о вашей организации, можно выбрать этот тип веб-сайта.",
    },
    {
        word:"Корпоративный сайт",
        def:"Корпоративный сайт - это многофункциональный сайт компании, создающийся как для информирования клиентов, так и для непосредственного преследования коммерческих целей. Корпоративный сайт представляет собой улучшенная версия сайта визитки. На нем обычно присутствуют своевременно обновляющаяся лента новостей, функция поиска, фотогалереи, формы для обратной связи с клиентами (отзывов, заявок). У сайта «РОСНЕФТЬ» удобный и стильный интерфейс, имеется раздел отзывов и предложений, возможность поиска по сайту, ссылка на сообщество в социальной сети «Вконтакте» и множество полезной информации по сфере деятельности организации. Плюсом является возможность создания для пользователей личного кабинета. У медицинского центра «Диамед» сайт содержит функцию «Вопрос доктору». У сайтов корпоративного типа обычно нет явных недостатков - они хорошо выполняют свои функции привлечения новых клиентов и поддержки уже существующих, но все же не имеют такого полного функционала, как следующий вид веб-сайтов.",
    },
    {
        word:"Портал",
        def:"Портал сайт ориентирован на обеспечение удобства клиентов всеми возможными способами. К функциональности портала относятся размещение фото, аудио и видео в виде специальных галерей, просмотр и прослушивание онлайн, форумы, блоги, рейтинги и голосования, система управления комментариями и обменом сообщениями между пользователями и так далее. Главная черта портала – очень активное взаимодействие с пользователем.Примером портала является образовательный ИТ-портал «GeekBrains», на котором учат людей с нуля осваивать программирование, веб-дизайн и маркетинг. Для этого на сайте проводятся онлайн-курсы со стажировкой и бесплатные мастер классы. Зарегистрировавшись на сайте, пользователи могут проходить тесты, смотреть вебинары, пользоваться форумом и вести свой блог. В разделе блога можно голосовать за лучшие статьи и самому набирать рейтинг, а также оставлять комментарии. И, как и все порталы, данный сайт имеет все черты корпоративного сайта. ИТ-портал очень удобен для людей, желающих получить знания в сфере ИТ.",
    },
    {
        word:"Сайт-сервис",
        def:"Сайт-сервис сконцентрирован на решении конкретной потребности клиента, либо нескольких однотипных потребностей. Типичным примером сервиса являются онлайн-консультанты, которые отвечают на вопрос введенный в всплывающем окне. Но такие функции сегодня встроены на каждом портале и на многих корпоративных сайтах. Есть же веб-ресурсы, полностью посвященные оказанию какой-либо услуги. Например, онлайн-школы, как школа английского языка «Skyeng». В ней работают профессионалы, помогающие жителям современных мегаполисов выучить английский язык в условиях недостатка времени. Школа проводит курсы английского языка, предоставляет возможность заниматься с репетитором онлайн, проводить обучение по скайпу. Уроки регулярные, преподавателя может выбрать сам пользователь. После окончания курса и сдачи экзамена клиенту выдается сертификат, и даются рекомендации для трудоустройства. Также существует огромное количество различных онлайн-курсов различных областей знаний, тренингов и семинаров, курсов переподготовки специалистов.",
    },
    {
        word:"Сайт-каталог",
        def:"Под каталогом понимается ресурс с витриной из товаров, где приводится их подробное описание, цена, зачастую даже существует возможность оставить отзывы о конкретных позициях, но нет возможности добавить товар в «корзину» и оформить заказ. Компания кухонной мебели «Зов» на своем сайте , представила каталог своих изделий, где можно посмотреть фото кухонь, их описание и параметры, примерную цену, а также поставить оценку. Известный сетевой магазин одежды «Zolla» тоже выбрал для своего веб ресурса вид каталога. Кроме фотографий изделий и цены на сайте для удобства поиска нужной вещи есть удобный фильтр. Также имеется возможность выбрать размер вещи и посмотреть, есть ли она в наличии в конкретном магазине. После регистрации можно добавлять изделия в список избранного.Сайт-каталог является разновидностью сайта-визитки или корпоративного сайта. По концепции, каталогу не хватает очень важной в наше время функции – возможности купить товар в любое время, не выходя из дома.",
    },
    {
        word:"Интернет-магазин",
        def:"Интернет-магазин - это самый популярный на данный момент вид коммерции в Интернете. Основная задача электронного магазина — это представление широкого ассортимента и возможности купить товар или услугу непосредственно на сайте. Чем сильнее компания облегчает клиенту жизнь, тем больше клиентов у нее становится. По своей форме все интернет-магазины очень похожи. Они очень напоминают портал: там также есть личный кабинет, возможность взаимодействия с другими пользователями, обратная связь и большое количество информации о компании и ее сфере деятельности. Но, конечно же, то что отличает интернет-магазин от всех других сайтов – факт покупки товара непосредственно на сайте. Оформление заказа осуществляется по типичной схеме: клиент выбирает товар, «складывает» его в Корзину, оформляет заказ, выбирает способ доставки и способ оплаты (оплата иногда осуществляется непосредственно при получении, а не на самом сайте). Примерами интернет-магазинов являются сайты всеми известных компаний: магазин электроники и бытовой техники «Эльдорадо» , магазин одежды и обуви «Lamoda» , книжный магазин «Читай-город» и многие другие.",
    },
    {
        word:"Лендинг",
        def:"Промо-сайт или лендинг используют в качестве эффективного инструмента продвижения какого-то одного продукта, услуги, акции, мероприятия. Это одностраничный тип сайта для захвата внимания клиента для последующего выполнения им целевого действия. Минимум всего отвлекающего: на лендинге размещается только ключевая информация, которая способна заинтересовать и побудить сделать покупку товара или заказать услуги. Их, как правило, отличает эффектный дизайн, наличие видеопрезентаций, качественных изображений продукта, его 3D-моделей. Примерами промо-сайтов являются онлайн-интерактивная платформа, которая предлагает бесплатные уроки кодирования <i>Codeacademy</i> и реклама юридических услуг <i>Адвекон Юц</i>.",
    },{
        word:"Социальные сети",
        def:"Мало какая компания может позволить себе собственную социальную сеть, но у любой фирмы есть возможность создать страницу или сообщество в уже существующих. Так делают множество организаций малого бизнеса, у которых нет возможности создать собственный сайт, и даже все те компании, у которых есть довольно хорошие веб- ресурсы, имеют представительства во многих социальных сетях, непременно указывая на основном сайте ссылки на них. Социальная сеть – это бесплатный и довольно эффективный инструмент маркетинга, ведь большинство людей проводит в них очень много времени. К тому же социальные сети предоставляют возможность более интерактивного общения компаний со своими клиентами, ведь основу этих сетей составляют именно коммуникации людей друг с другом. Примеры представительств компаний в социальной сети «Вконтакте»: - группа ювелирного магазина «Sunlight»; - сообщество книжного магазина «Читай-город»; - группа кинотеатра «Мадагаскар» в г. Саранск.",
    },
    {
        word:"Как выбрать ресурс?",
        def:"Кажется, что при таком разнообразии видов сайтов, сделать выбор для своей компании будет очень сложно. Но это не так. Все зависит от функционального назначения планируемого сайта.<br>Этапы следующие:</br><br><b>1) Определить цель, для которой создается веб-ресурс,</br><br> 2) Выбрать вид,</br><br> 3) Выбрать структуру,</br><br> 4) Выбрать функции,</br><br> 5) Выбрать дизайн и т.д.</b></br><br>Если нужно проинформировать людей о вашей организации, тогда стоит выбрать сайт-визитку, корпоративный сайт или даже портал. Компания занимается продажей товаров или услуг? Значит, стоить обратить внимание на сайт-каталог, интернет-магазин или же лендинг. Если вы хотите оказывать услуги онлайн, непосредственно через сайт, значит, вам нужен сайт-сервис.</br>",
    },
];

init = function(){
for(var i = 0; i < glossary.length; i++){
document.getElementById('word_list').innerHTML += "<li onclick='show(" + i + ")'>" + glossary[i].word + "</li>";
}
}
init();
show = function(i){
document.getElementById('word_text').innerHTML = glossary[i].word;
document.getElementById('definition').innerHTML = glossary[i].def;
var list = "";
}
show(0);